import numpy as np

# 算术运算符
# ------------------------------------------------------------------------------

a = np.arange(4)
# print(a)

# print(a + 4)
# print(a * 2)

b = np.arange(4, 8)
# print(b)

# print(a + b)
# print(a - b)
# print(a * b)

# 此外，这些运算符还适用于返回值为numpy数组的函数
# print(a * np.sin(b))
# print(a * np.sqrt(b))

# 对于多维数组，这些运算符仍然是元素级
A = np.arange(0, 9).reshape(3, 3)
# print(A)
B = np.ones((3, 3))
# print(B)

# print(A * B)

# 矩阵积
# ------------------------------------------------------------------------------

# print(np.dot(A, B))
# print(A.dot(B))
# print(np.dot(B, A))


# 自增和自减运算符
# ------------------------------------------------------------------------------

# 运算得到的结果不是赋给一个新数组而是赋给参与运算的数组自身
a = np.arange(4)
# print(a)
a += 1
# print(a)
a *= 2
# print(a)

# 通用函数
# ------------------------------------------------------------------------------


# 聚合函数
# ------------------------------------------------------------------------------
