# 引入装饰器
def w1(func):
    def inner():
        print('验证权限')
        func()

    return inner


@w1
def f1():
    print('f1函数被调用')


@w1
def f2():
    print('f2函数被调用')


# f1()
# f2()

# ------------------------------------------------------------------------------
# 装饰器的执行时机
def w1(func):
    print('装饰器开始装饰')

    def inner():
        print('验证权限')
        func()

    return inner


@w1
def test():
    print('test函数被调用')


test()
"""
装饰器开始装饰
验证权限
test函数被调用
"""
# 由此可以发现，当python解释器执行到@w1时，就开始进行装饰了
# ------------------------------------------------------------------------------
